
local _G = _G;
setfenv(1, NPC);

MAX_CHAT_OPTION_NUM = 4;

function OpenKeZhang()
	if not _G.IsUIShow(_G.NMAINSCENECHILDTAG.RoleInvite) then
		_G.CloseMainUI();
		_G.RoleInvite.LoadUI();
	end
end

NpcOptionFunc = 
{
	[1] = OpenKeZhang,
	[2] = OpenDaoJuDian,
	[3] = OpenCangKu,
	[4] = OpenYuPaiShangDian,
	[5] = OpenWuDao,
	[6] = OpenZhuangBeiDian,
	[7] = OpenShenMiShangDian,
};

NpcConfig = 
{
	--[2100501] = { "李太白", "欢迎", "商店", 1, },
	--[2100502] = { "", "标题为空则用npc的名字当标题", "宠物", 101 }
	[10001] = {"", "儿童散学归来早，忙趁东风放纸鸢。"};
	[10002] = {"", "笑迎八方来客，觅求天下知音。", "客栈", 1,};
	[10003] = {"", "君子爱财，取之有道！", "道具店", 2, };
	[10004] = {"", "管好小渔村我就心满意足了！"};
	[10005] = {"", "纵便江湖险恶，我辈崇尚武德！"};
	[10006] = {"", "冥冥之中，自有天意。"};
	[10007] = {"", "垂垂老矣，尚能饭否！"};
	[20001] = {"", "笑迎八方来客，觅求天下知音。", "客栈", 1,};
	[20002] = {"", "工欲善其事，必先利其器。", "装备商店", 6,};
	[20003] = {"", "君子爱财，取之有道！", "道具店", 2, };
	[20004] = {"", "有我做保管员，您还有什么不放心？","仓库", 3,};
	[20005] = {"", "宾客频频至，玉牌滚滚来！", "玉牌商店" ,4,};
	[20006] = {"", "遵循修道者的宿命！"};
	[20007] = {"", "散修之道亦可成仙！"};
	[30001] = {"", "我有你要的秘密武器！", "神秘商店", 7,};
	[30002] = {"", "笑迎八方来客，觅求天下知音。", "客栈", 1,};
	[30003] = {"", "工欲善其事，必先利其器。", "装备商店", 6,};
	[30004] = {"", "君子爱财，取之有道！", "道具店", 2, };
	[30005] = {"", "有我做保管员，您还有什么不放心？","仓库", 3,};
	[30006] = {"", "宾客频频至，玉牌滚滚来！", "玉牌商店" ,4,};
	[30007] = {"", "命格无双，谁人能挡？", "悟道", 5,};
	[30008] = {"", "散修之道亦可成仙！"};
	[30009] = {"", "身在其位，当谋其政。"};
	[40001] = {"", "我有你要的秘密武器！", "神秘商店", 7,};
	[40002] = {"", "笑迎八方来客，觅求天下知音。", "客栈", 1,};
	[40003] = {"", "工欲善其事，必先利其器。", "装备商店", 6,};
	[40004] = {"", "君子爱财，取之有道！", "道具店", 2, };
	[40005] = {"", "有我做保管员，您还有什么不放心？","仓库", 3,};
	[40006] = {"", "宾客频频至，玉牌滚滚来！", "玉牌商店" ,4,};
	[40007] = {"", "命格无双，谁人能挡？", "悟道", 5,};
	[40008] = {"", "道可道，非常道，名可名，非常名。"};
	[40009] = {"", "人法地，地法天，天法道，道法自然。"};
	[40010] = {"", "天下第一掌，玄黄第一门！"};
	[50001] = {"", "我有你要的秘密武器！", "神秘商店", 7,};
	[50002] = {"", "笑迎八方来客，觅求天下知音。", "客栈", 1,};
	[50003] = {"", "工欲善其事，必先利其器。", "装备商店", 6,};
	[50004] = {"", "君子爱财，取之有道！", "道具店", 2, };
	[50005] = {"", "有我做保管员，您还有什么不放心？","仓库", 3,};
	[50006] = {"", "宾客频频至，玉牌滚滚来！", "玉牌商店" ,4,};
	[50007] = {"", "命格无双，谁人能挡？", "悟道", 5,};
	[50008] = {"", "道曰大，大曰逝，逝曰远，远曰反。"};
	[50009] = {"", "道生一，一生二，二生三，三生万物。"};
	[50010] = {"", "黄泉第一宗，魔中第一帝！"};	
	[60001] = {"", "我有你要的秘密武器！", "神秘商店", 7,};
	[60002] = {"", "笑迎八方来客，觅求天下知音。", "客栈", 1,};
	[60003] = {"", "工欲善其事，必先利其器。", "装备商店", 6,};
	[60004] = {"", "君子爱财，取之有道！", "道具店", 2, };
	[60005] = {"", "有我做保管员，您还有什么不放心？","仓库", 3,};
	[60006] = {"", "宾客频频至，玉牌滚滚来！", "玉牌商店" ,4,};
	[60007] = {"", "命格无双，谁人能挡？", "悟道", 5,};
	[60008] = {"", "三清正法通灵，五气朝元转道。"};
	[60009] = {"", "火相回圣界，修心上天庭。"};
	[70001] = {"", "我有你要的秘密武器！", "神秘商店", 7,};
	[70002] = {"", "笑迎八方来客，觅求天下知音。", "客栈", 1,};
	[70003] = {"", "工欲善其事，必先利其器。", "装备商店", 6,};
	[70004] = {"", "君子爱财，取之有道！", "道具店", 2, };
	[70005] = {"", "有我做保管员，您还有什么不放心？","仓库", 3,};
	[70006] = {"", "宾客频频至，玉牌滚滚来！", "玉牌商店" ,4,};
	[70007] = {"", "命格无双，谁人能挡？", "悟道", 5,};
	[70008] = {"", "虚空无定相，无相生有相。"};
	[70009] = {"", "生即死，死即生，一啄一饮，此谓轮回。"};
};



 